In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
stl_schools = pd.read_csv("stl_schools_with_latlong.csv")

In [5]:
stl_schools.shape

(2260, 57)

In [6]:
stl_charter_schools = stl_schools[stl_schools["CHARTER"] == True]

In [7]:
stl_charter_schools.shape

(393, 57)

In [8]:
stl_magnet_schools = stl_schools[stl_schools["MAGNET"] == True]
stl_alternative_schools = stl_schools[stl_schools["ALTERNATIVE"] == True]
stl_neighborhood_schools = stl_schools[(stl_schools["CHARTER"] == False) & (stl_schools["MAGNET"] == False) & (stl_schools["ALTERNATIVE"] == False)]

In [11]:
# stl_magnet_schools.shape
# stl_alternative_schools.shape
stl_neighborhood_schools.shape

(1103, 57)

In [9]:
stl_charter_schools.columns

Index(['Unnamed: 0', 'YEAR', 'COUNTY_DISTRICT_CODE', 'DISTRICT_NAME',
       'SCHOOL_CODE', 'SCHOOL_NAME', 'ENROLLMENT_GRADES_K_12',
       'JANUARY_MEMBERSHIP', 'LUNCH_COUNT_FREE_REDUCED',
       'LUNCH_COUNT_FREE_REDUCTED_PCT', 'ENROLLMENT_ASIAN',
       'ENROLLMENT_ASIAN_PCT', 'ENROLLMENT_ASIAN_PACIFIC_ISLANDER',
       'ENROLLMENT_ASIAN_PACIFIC_ISLANDER_PCT', 'ENROLLMENT_BLACK',
       'ENROLLMENT_BLACK_PCT', 'ENROLLMENT_HISPANIC',
       'ENROLLMENT_HISPANIC_PCT', 'ENROLLMENT_INDIAN', 'ENROLLMENT_INDIAN_PCT',
       'ENROLLMENT_MULTIRACIAL', 'ENROLLMENT_MULTIRACIAL_PCT',
       'ENROLLMENT_PACIFIC_ISLANDER', 'ENROLLMENT_PACIFIC_ISLANDER_PCT',
       'ENROLLMENT_WHITE', 'ENROLLMENT_WHITE_PCT', 'ENROLLMENT_ELL_LEP',
       'ENROLLMENT_ELL_LEP_PCT', 'ENROLLMENT_GRADE_PK_ELL_LEP',
       'ENROLLMENT_GRADE_PK_ELL_LEP_PCT', 'IEP_SCHOOLAGE_CHILDCOUNT',
       'IEP_INCIDENCE_RATE', 'LUNCH_COUNT_FREE_REDUCED_PCT', 'SCHADDR1',
       'SCHADDR2', 'SCHCITY', 'SCHZIP', 'SCHLPHON', 'SCHLFAX', 'BGRADE',
       'EGRADE', 'SCHTTEACH', 'SCHENRR', 'SCHENRNR', 'SCHTENR',
       'ELEMENTARY_SCHOOL_FLAG', 'MIDDLE_SCHOOL_FLAG',
       'JUNIOR_HIGH_SCHOOL_FLAG', 'HIGH_SCHOOL_FLAG', 'AVTS_FLAG',
       'ALTERNATIVE_SCHOOL_FLAG', 'FULL_CODE', 'CHARTER', 'MAGNET',
       'ALTERNATIVE', 'lat', 'lng'],
      dtype='object')

In [12]:
charter_school_enrollment = pd.pivot_table(stl_charter_schools, values="ENROLLMENT_GRADES_K_12", index=["YEAR"], aggfunc=np.sum)

In [13]:
charter_school_enrollment.shape

(20, 1)

In [12]:
charter_school_enrollment.head()

      ENROLLMENT_GRADES_K_12
YEAR
2001                     783
2002                    1256
2003                    2280
2004                    2529
2005                    3350

In [14]:
magnet_school_enrollment = pd.pivot_table(stl_magnet_schools, values="ENROLLMENT_GRADES_K_12", index=["YEAR"], aggfunc=np.sum)
alternative_school_enrollment = pd.pivot_table(stl_alternative_schools, values="ENROLLMENT_GRADES_K_12", index=["YEAR"], aggfunc=np.sum)
neighborhood_school_enrollment = pd.pivot_table(stl_neighborhood_schools, values="ENROLLMENT_GRADES_K_12", index=["YEAR"], aggfunc=np.sum)

In [17]:
neighborhood_school_enrollment.head()

      ENROLLMENT_GRADES_K_12
YEAR
2000                   29452
2001                   29028
2002                   28428
2003                   27212
2004                   26026

In [18]:
enrollment = neighborhood_school_enrollment.merge(magnet_school_enrollment, how="outer", on="YEAR", suffixes=["_NEIGHBORHOOD", "_MAGNET"])
enrollment = enrollment.merge(alternative_school_enrollment, how="outer", on="YEAR", suffixes=[None, "_ALTERNATIVE"])
enrollment = enrollment.merge(charter_school_enrollment, how="outer", on="YEAR", suffixes=[None, "_CHARTER"])

In [19]:
enrollment.fillna(0)

,ENROLLMENT_GRADES_K_12_NEIGHBORHOOD,ENROLLMENT_GRADES_K_12_MAGNET,ENROLLMENT_GRADES_K_12,ENROLLMENT_GRADES_K_12_CHARTER
YEAR,,,,
2000,29452,13549,1263,0.0
2001,29028,12963,607,783.0
2002,28428,12192,770,1256.0
2003,27212,12184,970,2280.0
2004,26026,11673,1452,2529.0
2005,24307,11622,767,3350.0
2006,22723,11425,893,4514.0
2007,20406,10689,678,5405.0
2008,17092,10002,480,7719.0
2009,15278,10384,446,9221.0
2010,13947,10690,408,9579.0
2011,12734,10489,353,10308.0
2012,11739,10589,188,11467.0
2013,12766,12243,191,8480.0
2014,12563,12117,189,9249.0
2015,11816,11669,669,9749.0
2016,10360,11252,894,10806.0
2017,9809,10838,1107,10934.0
2018,8871,10861,1147,11189.0
2019,8910,10038,823,11390.0
2020,8161,10291,770,11739.0

In [20]:
enrollment.head()

,ENROLLMENT_GRADES_K_12_NEIGHBORHOOD,ENROLLMENT_GRADES_K_12_MAGNET,ENROLLMENT_GRADES_K_12,ENROLLMENT_GRADES_K_12_CHARTER
YEAR,,,,
2000,29452,13549,1263,NaN
2001,29028,12963,607,783.0
2002,28428,12192,770,1256.0
2003,27212,12184,970,2280.0
2004,26026,11673,1452,2529.0

In [21]:
enrollment.to_csv("enrollment_by_year2.csv")

In [10]:
n_2000 = stl_neighborhood_schools[stl_neighborhood_schools["YEAR"] == 2000]

In [11]:
n_2000.shape

(71, 57)

In [12]:
n_2020 = stl_neighborhood_schools[stl_neighborhood_schools["YEAR"] == 2020]

In [13]:
n_2020.shape

(38, 57)

In [14]:
c_2001 = stl_charter_schools[stl_charter_schools["YEAR"] == 2001]

In [15]:
c_2001.shape

(3, 57)

In [16]:
c_2001.head()

,Unnamed: 0,YEAR,COUNTY_DISTRICT_CODE,DISTRICT_NAME,SCHOOL_CODE,SCHOOL_NAME,ENROLLMENT_GRADES_K_12,JANUARY_MEMBERSHIP,LUNCH_COUNT_FREE_REDUCED,LUNCH_COUNT_FREE_REDUCTED_PCT,...,JUNIOR_HIGH_SCHOOL_FLAG,HIGH_SCHOOL_FLAG,AVTS_FLAG,ALTERNATIVE_SCHOOL_FLAG,FULL_CODE,CHARTER,MAGNET,ALTERNATIVE,lat,lng
718,718,2001,115115,ST. LOUIS CITY,3910,LIFT FOR LIFE ACADEMY,63,65.0,*,*,...,NaN,NaN,NaN,NaN,115-115-3910,True,False,False,38.608455,-90.200538
1987,1987,2001,115115,ST. LOUIS CITY,6915,ST. LOUIS CHARTER SCH.,526,516.0,340,65.9,...,NaN,NaN,NaN,NaN,115-115-6915,True,False,False,38.601907,-90.278729
2007,2007,2001,115115,ST. LOUIS CITY,6920,ETHEL HEDGEMAN LYLE ACADEMY,194,191.0,86,45,...,NaN,NaN,NaN,NaN,115-115-6920,True,False,False,38.632870,-90.200533

In [17]:
c_2020 = stl_charter_schools[stl_charter_schools["YEAR"] == 2020]

In [18]:
c_2020.shape

(37, 57)

In [19]:
m_2000 = stl_magnet_schools[stl_magnet_schools['YEAR'] == 2000]

In [20]:
m_2000.shape

(31, 57)

In [21]:
m_2020 = stl_magnet_schools[stl_magnet_schools['YEAR'] == 2020]

In [22]:
m_2020.shape

(27, 57)